# pandas

csv

### 纯文本，使用某个字符集，比如ASCII、Unicode、EBCDIC或GB2312（简体中文环境）等；
### 由记录组成（典型的是每行一条记录）；
### 每条记录被分隔符（英语：Delimiter）分隔为字段（英语：Field (computer science)）（典型分隔符有逗号、分号或制表符；有时分隔符可以包括可选的空格）；
### 每条记录都有同样的字段序列。

In [1]:
import pandas as pd
import numpy as np

In [47]:
abs_path = r'E:\tentcent_wechat_file\WeChat Files\m13613582372\FileStorage\File\2020-06\python编程入门\python编程入门\4、python进阶（上）\成绩表.csv'
df = pd.read_csv(abs_path)

In [5]:
df.head(5)

   序号   姓名 性别  语文  数学  英语  物理  化学  生物
0   1  凌榭辉  男  85  60  80  62  73  80
1   2   高海  男  85  80  67  74  86  80
2   3  潘锦乐  男  85  80  66  87  79  72
3   4  邹新宇  男  90  75  64  72  72  80
4   5  吴一中  男  80  76  69  64  72  80

In [6]:
type(df)

pandas.core.frame.DataFrame

# DataFrame

In [7]:
# 列名
print(df.columns)
# 索引
print(df.index)

Index(['序号', '姓名', '性别', '语文', '数学', '英语', '物理', '化学', '生物'], dtype='object')
RangeIndex(start=0, stop=37, step=1)

In [8]:
df.loc[0]

序号      1
姓名    凌榭辉
性别      男
语文     85
数学     60
英语     80
物理     62
化学     73
生物     80
Name: 0, dtype: object

In [9]:
a = np.array(range(10))
a > 3

array([False, False, False, False,  True,  True,  True,  True,  True,
        True])

In [10]:
df.loc[1]

序号     2
姓名    高海
性别     男
语文    85
数学    80
英语    67
物理    74
化学    86
生物    80
Name: 1, dtype: object

In [13]:
# 筛选数学成绩大于80
df[df.数学 > 80]

    序号   姓名 性别  语文  数学  英语  物理  化学  生物
7    8  秦佳艺  女  98  90  96  93  96  80
20  21  黄金虎  男  90  90  84  91  98  80
30  31   李佳  男  90  90  78  93  92  80

In [14]:
df[df.数学< 70]

   序号   姓名 性别  语文  数学  英语  物理  化学  生物
0   1  凌榭辉  男  85  60  80  62  73  80
5   6   杨烨  男  90  60  85  34  78  80

In [16]:
#复杂筛选
df[(df.语文>80)& (df.数学 > 80) & (df.英语 > 80)]

    序号   姓名 性别  语文  数学  英语  物理  化学  生物
7    8  秦佳艺  女  98  90  96  93  96  80
20  21  黄金虎  男  90  90  84  91  98  80

###  排序

In [20]:
df.sort_values(['数学','语文']).head()

    序号   姓名 性别  语文  数学  英语  物理  化学  生物
0    1  凌榭辉  男  85  60  80  62  73  80
5    6   杨烨  男  90  60  85  34  78  80
3    4  邹新宇  男  90  75  64  72  72  80
4    5  吴一中  男  80  76  69  64  72  80
13  14  李杜伟  男  85  78  80  60  89  80

In [22]:
df.head()

   序号   姓名 性别  语文  数学  英语  物理  化学  生物
0   1  凌榭辉  男  85  60  80  62  73  80
1   2   高海  男  85  80  67  74  86  80
2   3  潘锦乐  男  85  80  66  87  79  72
3   4  邹新宇  男  90  75  64  72  72  80
4   5  吴一中  男  80  76  69  64  72  80

### 访问

In [23]:
# loc[] 按照索引进行定位
df.loc[1]

序号     2
姓名    高海
性别     男
语文    85
数学    80
英语    67
物理    74
化学    86
生物    80
Name: 1, dtype: object

## 索引

In [41]:
scores = {
    '英语':[90,78,89],
    '数学':[64,78,45],
    '姓名':['wang','li','sun']
}
df = pd.DataFrame(scores,index=['one','two','three'])
df

       英语  数学    姓名
one    90  64  wang
two    78  78    li
three  89  45   sun

In [42]:
df.index

Index(['one', 'two', 'three'], dtype='object')

In [50]:
# 因为不存在数字索引,不能通过数字索引去访问
df.loc[1]

序号     2
姓名    高海
性别     男
语文    85
数学    80
英语    67
物理    74
化学    86
生物    80
Name: 1, dtype: object

In [43]:
df.loc['one']

英语      90
数学      64
姓名    wang
Name: one, dtype: object

In [44]:
#  iloc[] 真实的第几行
df.iloc[0]

英语      90
数学      64
姓名    wang
Name: one, dtype: object

In [65]:
# 合并了loc和iloc的功能
df.ix[0]

AttributeError: 'DataFrame' object has no attribute 'ix'

In [66]:
df.loc[:2]

   序号   姓名 性别  语文  数学  英语  物理  化学  生物
0   1  凌榭辉  男  85  60  80  62  73  80
1   2   高海  男  85  80  67  74  86  80
2   3  潘锦乐  男  85  80  66  87  79  72

In [53]:
df.iloc[:2]

   序号   姓名 性别  语文  数学  英语  物理  化学  生物
0   1  凌榭辉  男  85  60  80  62  73  80
1   2   高海  男  85  80  67  74  86  80

In [54]:
# 访问某一行
# df[0] 错误
# 访问多行数据 使用切片
df[:2]

   序号   姓名 性别  语文  数学  英语  物理  化学  生物
0   1  凌榭辉  男  85  60  80  62  73  80
1   2   高海  男  85  80  67  74  86  80

In [59]:
# dataframe 中的数组
df.数学.values

array([60, 80, 80, 75, 76, 60, 78, 90, 80, 80, 80, 80, 80, 78, 80, 80, 80,
       80, 80, 80, 90, 80, 80, 80, 80, 78, 80, 78, 80, 80, 90, 80, 80, 80,
       80, 80, 80], dtype=int64)

In [68]:
df.数学.value_counts()

80    26
78     4
90     3
60     2
76     1
75     1
Name: 数学, dtype: int64

In [69]:
df.head()

   序号   姓名 性别  语文  数学  英语  物理  化学  生物
0   1  凌榭辉  男  85  60  80  62  73  80
1   2   高海  男  85  80  67  74  86  80
2   3  潘锦乐  男  85  80  66  87  79  72
3   4  邹新宇  男  90  75  64  72  72  80
4   5  吴一中  男  80  76  69  64  72  80

In [70]:
df['数学']

0     60
1     80
2     80
3     75
4     76
5     60
6     78
7     90
8     80
9     80
10    80
11    80
12    80
13    78
14    80
15    80
16    80
17    80
18    80
19    80
20    90
21    80
22    80
23    80
24    80
25    78
26    80
27    78
28    80
29    80
30    90
31    80
32    80
33    80
34    80
35    80
36    80
Name: 数学, dtype: int64

In [74]:
# 提取多列
new = df[['数学','语文']].head()
new

   数学  语文
0  60  85
1  80  85
2  80  85
3  75  90
4  76  80

In [75]:
new * 2

    数学   语文
0  120  170
1  160  170
2  160  170
3  150  180
4  152  160

In [76]:
new

   数学  语文
0  60  85
1  80  85
2  80  85
3  75  90
4  76  80

### map函数 分类

In [77]:
# 分类  map函数
def func(score):
    if score >= 80:
        return '优秀'
    elif score >= 70:
        return '良'
    elif score >= 60:
        return '及格'
    else:
        return '不及格'
    
df['数学分类'] = df.数学.map(func)

In [79]:
df.head()

   序号   姓名 性别  语文  数学  英语  物理  化学  生物 数学分类
0   1  凌榭辉  男  85  60  80  62  73  80   及格
1   2   高海  男  85  80  67  74  86  80   优秀
2   3  潘锦乐  男  85  80  66  87  79  72   优秀
3   4  邹新宇  男  90  75  64  72  72  80    良
4   5  吴一中  男  80  76  69  64  72  80    良

## applymap 对dataframe所有数据进行操做

In [85]:
def func(number):
    return number + 10
# 等价
func = lambda:  number + 10 

df.applymap(lambda x: str(x) + '-').head()

   序号    姓名  性别   语文   数学   英语   物理   化学   生物 数学分类
0  1-  凌榭辉-  男-  85-  60-  80-  62-  73-  80-  及格-
1  2-   高海-  男-  85-  80-  67-  74-  86-  80-  优秀-
2  3-  潘锦乐-  男-  85-  80-  66-  87-  79-  72-  优秀-
3  4-  邹新宇-  男-  90-  75-  64-  72-  72-  80-   良-
4  5-  吴一中-  男-  80-  76-  69-  64-  72-  80-   良-

# 匿名函数

In [86]:
[i + 100 for i in range(10)]

[100, 101, 102, 103, 104, 105, 106, 107, 108, 109]

In [88]:
def func(x):
    return x + 100

In [92]:
list(map(lambda x: x +1000 ,range(10)))

[1000, 1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009]

In [93]:
df.apply(lambda x: x .数学,axis = 1)

0     60
1     80
2     80
3     75
4     76
5     60
6     78
7     90
8     80
9     80
10    80
11    80
12    80
13    78
14    80
15    80
16    80
17    80
18    80
19    80
20    90
21    80
22    80
23    80
24    80
25    78
26    80
27    78
28    80
29    80
30    90
31    80
32    80
33    80
34    80
35    80
36    80
dtype: int64

In [97]:
# 根据多列生成新的一个列的操作,用 apply
df['new_score'] = df.apply(lambda x: x.数学 + x.语文,axis = 1)

In [98]:
# 前几行
df.head()
# 后几行
df.tail()

    序号   姓名 性别  语文  数学  英语  物理  化学  生物 数学分类  new_score
32  33   张淇  女  90  80  86  75  87  75   优秀        170
33  34  张雅倩  女  90  80  93  90  97  80   优秀        170
34  35  王向丹  男  90  80  94  88  84  80   优秀        170
35  36  顾振楠  男  85  80  93  88  93  78   优秀        165
36  37  沈嘉辉  男  90  80  80  67  94  80   优秀        170

## pandas 中的dataframe 的操作,很大一部分跟numpy中的二维数组的操作是近似的

# 绘图  matplotlib

In [104]:
df = df.drop(['new_score'],axis = 1)

In [106]:
df.head()

   序号   姓名 性别  语文  数学  英语  物理  化学  生物 数学分类
0   1  凌榭辉  男  85  60  80  62  73  80   及格
1   2   高海  男  85  80  67  74  86  80   优秀
2   3  潘锦乐  男  85  80  66  87  79  72   优秀
3   4  邹新宇  男  90  75  64  72  72  80    良
4   5  吴一中  男  80  76  69  64  72  80    良

In [107]:
df.tail()

    序号   姓名 性别  语文  数学  英语  物理  化学  生物 数学分类
32  33   张淇  女  90  80  86  75  87  75   优秀
33  34  张雅倩  女  90  80  93  90  97  80   优秀
34  35  王向丹  男  90  80  94  88  84  80   优秀
35  36  顾振楠  男  85  80  93  88  93  78   优秀
36  37  沈嘉辉  男  90  80  80  67  94  80   优秀

# matplotlib

In [113]:
pip list

Package           Version
----------------- ----------
astroid           2.4.1
backcall          0.1.0
beautifulsoup4    4.9.1
bs4               0.0.1
certifi           2020.4.5.2
chardet           3.0.4
colorama          0.4.3
decorator         4.4.2
idna              2.9
ipykernel         5.3.0
ipython           7.15.0
ipython-genutils  0.2.0
isort             4.3.21
jedi              0.17.0
jupyter-client    6.1.3
jupyter-core      4.6.3
lazy-object-proxy 1.4.3
mccabe            0.6.1
mysqlclient       1.4.6
numpy             1.18.5
pandas            1.0.4
parso             0.7.0
pickleshare       0.7.5
pip               19.3.1
prompt-toolkit    3.0.5
Pygments          2.6.1
pylint            2.5.2
python-dateutil   2.8.1
pytz              2020.1
pywin32           227
pyzmq             19.0.1
reqeusts          1000.0.0
requests          2.23.0
setuptools        41.2.0
six               1.14.0
soupsieve         2.0.1
toml              0.10.1
tornado           6.0.4
traitlets         4.3.3
urllib3           1.25.9
virtualenv        16.7.8
wcwidth           0.2.4
wheel             0.33.6
wrapt             1.12.1
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 19.3.1; however, version 20.1.1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.